//Main
#include <thread>
#include <iostream>
#include <Windows.h>
#include <TlHelp32.h>

//Icon
#include "resource.h"

//Overlay
#include <dwmapi.h>
#pragma comment(lib, "dwmapi.lib")

//D3D9
#include <d3d9.h>
#include <d3dx9.h>
#pragma comment(lib, "d3d9.lib")
#pragma comment(lib, "d3dx9.lib")

//ImGui
#include "imgui.h"
#include "imgui_internal.h"
#include "imgui_impl_dx9.h"
#include "imgui_impl_win32.h"

//mINI
#define MINI_CASE_SENSITIVE
#include "ini.h"

//Offsets
#define OFFSET_LOCAL_PLAYER                             0x05B49F78UL//1.3.1.26
#define OFFSET_ENTITY_LIST                              0x05923C48UL//1.3.1.26
#define OFFSET_MAIN                                     0x05BAA290UL//1.3.1.26
#define OFFSET_CAMERA                                   0x06B54E68UL//1.3.1.26
#define OFFSET_CHAR_CONTROLLER                          0x05DA26F0UL//1.3.1.26
#define OFFSET_GET_PTR_A1                               0x0592A7A8UL//1.3.1.26
#define OFFSET_GET_PTR_A2                               0x03CE0F90UL//1.3.1.26
#define OFFSET_MESSAGE_SENDER                           0x014AA5E0UL//1.3.1.26
#define OFFSET_FAKE_MESSAGE                             0x0142696EUL//1.3.1.26
#define OFFSET_DATA_HANDLER                             0x05753DC0UL//1.3.0.23
#define OFFSET_INFINITE_AMMO                            0x00BFC853UL//1.3.0.23
#define OFFSET_REDIRECTION                              0x01757B8EUL//1.3.0.23

#define VTABLE_TESLEVITEM                               0x0385BB10UL//1.3.1.26
#define VTABLE_CURRENCYOBJECT                           0x038545A0UL//1.3.1.26
#define VTABLE_REQUESTACTIVATEREFMSG                    0x03B1BAD0UL//1.3.1.26
#define VTABLE_REQUESTTRANSFERITEMMSG                   0x03B2FD28UL//1.3.1.26
#define VTABLE_REQUESTTELEPORTTOLOCATIONMSG             0x03B23D60UL//1.3.1.26
#define VTABLE_CLIENTSTATEMSG                           0x03B23940UL//1.3.1.26
#define VTABLE_REQUESTHITSONACTORS                      0x03B1B700UL//1.3.1.26

//Item Transferring Id
#define UNKNOWN_TRANSFER_ID                             0xE0001F7AUL//1.3.0.23

//Noclip
#define NOCLIP_DYNAMIC_CALL_A       { 0xE8, 0xA8, 0xD3, 0xFE, 0xFF }//1.3.0.23
#define NOCLIP_DYNAMIC_CALL_B       { 0xE8, 0xB5, 0xE1, 0x32, 0x01 }//1.3.0.23

//CustomEntry Flags
#define CUSTOM_ENTRY_DEFAULT                            0x0000000000000000ULL
#define CUSTOM_ENTRY_UNNAMED                            0x0000000000000001ULL
#define CUSTOM_ENTRY_PLAYER                             0x0000000000000002ULL
#define CUSTOM_ENTRY_NPC                                0x0000000000000004ULL
#define CUSTOM_ENTRY_CONTAINER                          0x0000000000000008ULL
#define CUSTOM_ENTRY_JUNK                               0x0000000000000010ULL
#define CUSTOM_ENTRY_PLAN                               0x0000000000000020ULL
#define CUSTOM_ENTRY_ITEM                               0x0000000000000040ULL
#define CUSTOM_ENTRY_ENTITY                             0x0000000000000080ULL
#define CUSTOM_ENTRY_VALID_SCRAP                        0x0000000000000100ULL
#define CUSTOM_ENTRY_VALID_ITEM                         0x0000000000000200ULL
#define CUSTOM_ENTRY_MAGAZINE                           0x0000000000000400ULL
#define CUSTOM_ENTRY_BOBBLEHEAD                         0x0000000000000800ULL
#define	CUSTOM_ENTRY_FLORA                              0x0000000000001000ULL
#define CUSTOM_ENTRY_MISC                               0x0000000000002000ULL
#define CUSTOM_ENTRY_MOD                                0x0000000000004000ULL
#define CUSTOM_ENTRY_WEAPON                             0x0000000000008000ULL
#define CUSTOM_ENTRY_ARMOR                              0x0000000000010000ULL
#define CUSTOM_ENTRY_AMMO                               0x0000000000020000ULL
#define CUSTOM_ENTRY_AID                                0x0000000000040000ULL
#define CUSTOM_ENTRY_VALID_INGREDIENT                   0x0000000000080000ULL
#define CUSTOM_ENTRY_KNOWN_RECIPE                       0x0000000000100000ULL
#define CUSTOM_ENTRY_UNKNOWN_RECIPE                     0x0000000000200000ULL
#define CUSTOM_ENTRY_FAILED_RECIPE                      0x0000000000400000ULL
#define CUSTOM_ENTRY_TREASURE_MAP                       0x0000000000800000ULL
#define CUSTOM_ENTRY_WHITELISTED                        0x4000000000000000ULL
#define CUSTOM_ENTRY_INVALID                            0x8000000000000000ULL

//Game Classes
class RequestActivateRefMessage
{
public:
	DWORD64 vtable;//0x0
	DWORD Formid;//0x8
	BYTE Choice;//0xC
	BYTE ForceActivate;//0xB
};

class Camera
{
public:
	DWORD64 vtable;//0x0
	BYTE Padding0008[0xD8];
	float Forward[3];//0xE0
	BYTE Padding00EC[0x24];
	float Origin[3];//0x110
	BYTE Padding011C[0x14];
	float View[16];//0x130
};

class FalloutMain
{
public:
	DWORD64 vtable;//0x0
	BYTE Padding0008[0x338];
	DWORD64 PlatformSessionManagerPtr;//0x340
};

class PlatformSessionManager
{
public:
	DWORD64 vtable;//0x0
	BYTE Padding0008[0x78];
	DWORD64 ClientAccountManagerPtr;//0x80
};

class ClientAccountManager
{
public:
	DWORD64 vtable;//0x0
	BYTE Padding0008[0x38];
	DWORD64 ClientAccountArrayPtr;//0x40
	BYTE Padding0048[0x8];
	int ClientAccountArraySizeA;//0x50
	BYTE Padding0054[0x4];
	int ClientAccountArraySizeB;//0x58
};

class ClientAccountBuffer
{
public:
	DWORD64 NamePtr;//0x0
	DWORD64 ClientAccountPtr;//0x8
};

class ClientAccount
{
public:
	DWORD64 vtable;//0x0
	BYTE Padding0008[0x8];
	BYTE NameData[0x10];//0x10
	int NameLength;//0x20
	BYTE Padding0024[0x58];
	DWORD Formid;//0x7C
};

class EntityListType
{
public:
	BYTE Padding0000[0x80];
	DWORD64 InteriorListPtr;//0x80
	DWORD64 InteriorListCheck;//0x88
	BYTE Padding0090[0x18];
	DWORD64 ExteriorListPtr;//0xA8
	DWORD64 ExteriorListCheck;//0xB0
};

class EntityList
{
public:
	BYTE Padding0000[0x80];
	DWORD64 ListPtr;//0x80
	BYTE Padding0088[0x8];
	int ListSize;//0x90
};

class Entity
{
public:
	DWORD64 vtable;//0x0
	BYTE Padding0008[0x8];
	BYTE HarvestFlagA;//0x10
	BYTE Padding0011[0x8];
	BYTE HarvestFlagB;//0x19
	BYTE Padding001A[0x6];
	DWORD Formid;//0x20
	BYTE Padding0024[0x14];
	BYTE IdValue[4];//0x38
	BYTE Padding003C[0x14];
	DWORD64 vtable0050;//0x50
	BYTE Padding0058[0x8];
	float Pitch;//0x60
	BYTE Padding0064[0x4];
	float Yaw;//0x68
	BYTE Padding006C[0x4];
	float Position[3];//0x70
	BYTE Padding007C[0x4];
	DWORD64 InventoryPtr;//0x80
	BYTE Padding0088[0x8];
	DWORD64 ActorCorePtr;//0x90
	BYTE Padding0098[0x10];
	DWORD64 CellPtr;//0xA8
	DWORD64 SkeletonPtr;//0xB0
	DWORD64 ReferencePtr;//0xB8
	BYTE Padding00C0[0xE];
	BYTE SpawnFlag;//0xCE
	BYTE Padding00CF[0xC9];
	BYTE MovementFlag;//0x198
	BYTE SprintFlag;//0x199
	BYTE HealthFlag;//0x19A
	BYTE Padding019B[0xA89];
	DWORD Formid0C24;//0xC24
};

class Reference
{
public:
	DWORD64 vtable;//0x0
	BYTE Padding0008[0x10];
	BYTE RecordFlagA;//0x18
	BYTE Padding0019[0x7];
	DWORD Formid;//0x20
	BYTE Padding0024[0x74];
	DWORD64 NamePtr0098;//0x98
	BYTE Padding00A0[0x10];
	DWORD64 NamePtr00B0;//0xB0
	DWORD64 KeywordArrayData00B8;//0xB8
	DWORD64 KeywordArrayData00C0;//0xC0
	BYTE Padding00B8[0x19];
	BYTE OMODFlag;//0xE1
	BYTE Padding00E2[0x7E];
	DWORD64 NamePtr0160;//0x160
	BYTE Padding0168[0x48];
	DWORD64 KeywordArrayData01B0;//0x1B0
	DWORD64 KeywordArrayData01B8;//0x1B8
	DWORD64 KeywordArrayData01C0;//0x1C0
	BYTE Padding01C4[0x10];
	BYTE PlanFlag;//0x1D8
	BYTE Padding01D9[0xF];
	DWORD64 ComponentArrayPtr;//0x1E8
	BYTE Padding01F0[0x8];
	int ComponentArraySize;//0x1F8
	BYTE Padding01FC[0x14];
	DWORD64 HarvestedPtr;//0x210
};

class Component
{
public:
	DWORD64 ComponentReferencePtr;//0x0
	DWORD64 ComponentCountReferencePtr;//0x8
};

class ReferenceList
{
public:
	DWORD64 ArrayPtr;//0x0
	BYTE Padding0008[0x8];
	int ArraySize;//0x10
};

class Weapon
{
public:
	DWORD64 vtable;//0x08
	BYTE Padding0008[0x18];
	DWORD Formid;//0x20
	BYTE Padding0024[0x19C];
	DWORD64 KeywordArrayPtr;//0x1C0
	int KeywordArraySize;//0x1C8
	BYTE Padding01D0[0xE0];
	DWORD64 AimModelPtr;//0x2B0
	BYTE Padding02B8[0x44];
	float ReloadSpeed;//0x2FC
	BYTE Padding0300[0x4];
	float Speed;//0x304
	float Reach;//0x308
	BYTE Padding030C[0x2C];
	float ActionPointCost;//0x338
	BYTE Padding033C[0x24];
	BYTE FlagA;//0x360
	BYTE FlagB;//0x361
	BYTE FlagC;//0x362
	BYTE FlagD;//0x363
	BYTE Padding0364[0x1C];
	short Capacity;//0x380
};

class AimModel
{
public:
	DWORD64 vtable;//0x8
	BYTE Padding0008[0x18];
	DWORD Formid;//0x20
	BYTE Padding0024[0x4];
	BYTE SpreadData[0x18];//0x28
	BYTE RecoilData[0x24];//0x40
	float Sway;//0x64
};

class bhkCharProxyController
{
public:
	DWORD64 vtable;//0x0
	BYTE Padding0008[0x4A8];
	DWORD64 hknpBSCharacterProxyPtr;//0x4B0
};

class hknpBSCharacterProxy
{
public:
	DWORD64 vtable;//0x0
	BYTE Padding0008[0x48];
	float Rotation[2];//0x50
	BYTE Padding0058[0x18];
	float Position[3];//0x70
	BYTE Padding007C[0x24];
	float VelocityA[4];//0xA0
	float VelocityB[4];//0xB0
};

class Inventory
{
public:
	DWORD64 vtable;//0x0
	BYTE Padding0008[0x58];
	DWORD64 ItemArrayPtr;//0x60
	DWORD64 ItemArrayEnd;//0x68
};

class Item
{
public:
	DWORD64 ReferencePtr;//0x0
	BYTE Padding0008[0x8];
	DWORD64 DisplayPtr;//0x10
	BYTE Padding0018[0x8];
	DWORD64 Iterations;//0x20
	BYTE EquipFlag;//0x28
	BYTE Padding0025[0x3];
	DWORD ItemId;//0x2C
	BYTE FavoriteIndex;//0x30
	BYTE Padding0031[0x7];
};

class ItemCount
{
public:
	BYTE Padding0000[0x8];
	int Count;//0x8
	BYTE Padding000C[0x4];
};

class ItemInstancedArray
{
public:
	BYTE Padding0000[0x10];
	DWORD64 ArrayPtr;//0x10
	BYTE Padding0018[0x8];
	DWORD64 ArrayEnd;//0x20
};

class ExtraTextDisplayData
{
public:
	DWORD64 vtable;//0x0
	BYTE Padding0008[0x8];
	DWORD64 InstancedNamePtr;//0x10
};

class TransferMessage
{
public:
	DWORD64 vtable;//0x0
	DWORD SrcFormid;//0x8
	DWORD DstFormid;//0xC
	DWORD UnknownId;//0x10
	DWORD ItemId;//0x14
	int Count;//0x18
	DWORD UnknownA;//0x1C
	BYTE UnknownB;//0x20
	BYTE UnknownC;//0x21
};

class ActorValueInformation
{
public:
	DWORD64 vtable;//0x8
	BYTE Padding0008[0x18];
	DWORD Formid;//0x20
	BYTE Padding0024[0x1DC];
	float MaximumValue;//0x200
};

class RequestTeleportMessage
{
public:
	DWORD64 vtable;//0x0
	float PositionX;//0x8
	float PositionY;//0xC
	float PositionZ;//0x10
	float RotationX;//0x14
	float RotationY;//0x18
	float RotationZ;//0x1C
	DWORD64 CellPtr;//0x20
};

class ClientStateMsg
{
public:
	DWORD64 vtable;//0x0
	DWORD64 ClientState;//0x8
};

class RequestHitsOnActors
{
public:
	DWORD64 vtable;//0x0
	DWORD64 HitsArrayPtr;//0x8
	DWORD64 HitsArrayEnd;//0x10
	BYTE Padding0018[0x48];
};

class Hits
{
public:
	DWORD ValueA;//0x0 (Local Player)
	DWORD ValueB;//0x4 (Entity)
	DWORD ValueC;//0x8 (Projectile == 0)
	DWORD InitializationType;//0xC (3 == Default/Gun, 4 == Explosive)
	DWORD uiWeaponServerID;//0x10
	DWORD LIMB_ENUM;//0x20 (0xFFFFFFFF == Default/Body)
	DWORD HitEffectID;//0x18 (0 == Default/Gun)
	DWORD uEquipIndex;//0x1C (0 == Default/Gun)
	BYTE uAckIndex;//0x20 (Shots Hit, Always > 0)
	BYTE uFireID;//0x21 (Shots Fired)
	BYTE bPredictedKill;//0x22
	BYTE Padding0023;//0x23 (0)
	float ExplosionLocationX;//0x24
	float ExplosionLocationY;//0x28
	float ExplosionLocationZ;//0x2C
	float fProjectilePower;//0x30 (1.0f == Default)
	BYTE bVatsAttack;//0x34
	BYTE bVatsCritical;//0x35
	BYTE bTargetWasDead;//0x36
	BYTE Padding0037;//0x37 (0)
};

class BGSQuestText
{
public:
	DWORD64 vtable;//0x0
	DWORD64 FormidPtr;//0x8
	BYTE Padding0010[0x28];
	DWORD64 CodePtr;//0x38
};

class ActorSnapshotComponent
{
public:
	//ActorCoreSnapshotComponent
	DWORD64 ActorCorevtable;//0x0
	BYTE ActorCorePadding0008[0xB8];
	//ActorServerAuthSnapshotData
	DWORD64 vtable;//0x0
	BYTE Padding0008[0x33];
	BYTE IsEssential;//0x3B
	BYTE Padding003C[0x34];
	float MaxHealth;//0x70
	float ModifiedHealth;//0x74
	BYTE Padding0078[0x4];
	float LostHealth;//0x7C
	BYTE Padding0080[0xB0];
	BYTE EpicRank;//0x130
	BYTE Padding0131[0x7];
};

class LeveledList
{
public:
	DWORD64 vtable;//0x0
	BYTE Padding0008[0x18];
	DWORD Formid;//0x20
	BYTE Padding0024[0x8C];
	DWORD64 ListEntryArrayPtr;//0xB0
	BYTE Padding00B8[0x9];
	BYTE ListEntryArraySize;//0xC1
};

class ListEntry
{
public:
	DWORD64 ReferencePtr;//0x0
	DWORD64 ExtraData;//0x8
	DWORD64 Conditions;//0x10
	float Quantity;//0x18
	DWORD QuantityPadding;//0x1C
	DWORD64 QuantityGlobal;//0x20
	DWORD64 QuantityGlobalPadding;//0x28;
	float ChanceNoneValue;//0x30
	DWORD ChanceNoneValuePadding;//0x34
	DWORD64 ChanceNoneGlobal;//0x38
	DWORD64 ChanceNoneCurveTable;//0x40
	float MinimumLevel;//0x48
	DWORD MinimumLevelPadding;//0x4C
	DWORD64 MinimumLevelGlobal;//0x50
	DWORD64 MinimumLevelCurveTable;//0x58
	DWORD64 MinimumLevelCurveTablePadding;//0x68
};

class ProcessLists
{
public:
	DWORD64 vtable;//0x0
	BYTE Padding0008[0x48];
	DWORD64 NPCIdArrayPtrA;//0x50
	BYTE Padding0058[0x8];
	int NPCIdArraySizeA;//0x60
	BYTE Padding0064[0x1C];
	DWORD64 NPCIdArrayPtrB;//0x80
	BYTE Padding0088[0x8];
	int NPCIdArraySizeB;//0x90
};

class Chargen
{
public:
	BYTE Padding[0x28];
	float Thin;//0x28
	float Muscular;//0x2C
	float Large;//0x30
};

class ModInstance
{
public:
	DWORD64 ModListPtr;//0x0
	int ModListSize;//0x8
};

class ObjectInstanceExtra
{
public:
	BYTE Padding0000[0x10];
	DWORD64 ModDataPtr;//0x10
};

//Custom Classes
class CustomEntry
{
public:
	DWORD64 EntityPtr;
	DWORD64 ReferencePtr;
	DWORD EntityFormid;
	DWORD ReferenceFormid;
	DWORD64 Flag;
	char *Name;
};

class OldWeapon
{
public:
	Weapon *WeaponData;
	AimModel *AimModelData;
};

class ExecutionList
{
public:
	BYTE ASM[0x40]				//0x0
	{
		0x55,					//push rbp
		0x56,					//push rsi
		0x57,					//push rdi
		0x48, 0x83, 0xEC, 0x28,	//sub rsp, 0x28
		0x48, 0x8B, 0xF1,		//mov rsi, rcx
		0x48, 0x8B, 0x2E,		//mov rbp, [rsi]
		0x31, 0xFF,				//xor edi, edi
		0x48, 0x8B, 0x46, 0x10,	//mov rax, [rsi + 0x10]
		0x48, 0x8B, 0x0C, 0xF8,	//mov rcx, [rax + rdi * 0x8]
		0x48, 0x8B, 0x46, 0x18,	//mov rax, [rsi + 0x18]
		0x48, 0x8D, 0x14, 0xF8,	//lea rdx, [rax + rdi * 0x8]
		0xFF, 0xD5,				//call rbp
		0xFF, 0xC7,				//inc edi
		0x3B, 0x7E, 0x08,		//cmp edi, [rsi + 0x08]
		0x72, 0xE7,				//jb ID_TO_PTR_LOOP
		0x48, 0x83, 0xC4, 0x28,	//add rsp, 0x28
		0x5F,					//pop rdi
		0x5E,					//pop rsi
		0x5D,					//pop rbp
		0xC3,					//ret
		0xCC, 0xCC, 0xCC, 0xCC,	//Padding
		0xCC, 0xCC, 0xCC, 0xCC,	//Padding
		0xCC, 0xCC, 0xCC, 0xCC,	//Padding
		0xCC, 0xCC, 0xCC, 0xCC,	//Padding
	};
	DWORD64 Function;			//0x40 (0x0)
	DWORD64 IdArraySize;		//0x48 (0x8)
	DWORD64 IdArray;			//0x50 (0x10)
	DWORD64 PtrArray;			//0x58 (0x18)
};

class ExecutionPlan
{
public:
	BYTE ASM[0x40]				//0x0
	{
		0x55,					//push rbp
		0x56,					//push rsi
		0x57,					//push rdi
		0x48, 0x83, 0xEC, 0x28,	//sub rsp, 0x28
		0x48, 0x8B, 0xF1,		//mov rsi, rcx
		0x48, 0x8B, 0x2E,		//mov rbp, [rsi]
		0x31, 0xFF,				//xor edi, edi
		0x48, 0x8B, 0x4E, 0x08,	//mov rcx, [rsi + 0x08]
		0x48, 0x8B, 0x46, 0x18,	//mov rax, [rsi + 0x18]
		0x48, 0x8B, 0x14, 0xF8,	//mov rdx, [rax + rdi * 0x8]
		0xFF, 0xD5,				//call rbp
		0x48, 0x8B, 0x4E, 0x20,	//mov rcx, [rsi+ 0x20]
		0x88, 0x04, 0x39,		//mov [rcx + rdi], al
		0xFF, 0xC7,				//inc edi
		0x3B, 0x7E, 0x10,		//cmp edi, [rsi + 0x10]
		0x72, 0xE4,				//jb GET_RECIPE_LOOP
		0x48, 0x83, 0xC4, 0x28,	//add rsp, 0x28
		0x5F,					//pop rdi
		0x5E,					//pop rsi
		0x5D,					//pop rbp
		0xC3,					//ret 
		0xCC,					//Padding
		0xCC, 0xCC, 0xCC, 0xCC,	//Padding
		0xCC, 0xCC, 0xCC, 0xCC,	//Padding
		0xCC, 0xCC, 0xCC, 0xCC,	//Padding
	};
	DWORD64 Function;			//0x40 (0x00)
	DWORD64 LocalPlayerPtr;		//0x48 (0x08)
	DWORD64 RecipeArraySize;	//0x50 (0x10)
	DWORD64 RecipeArray;		//0x58 (0x18)
	DWORD64 LearnedRecipeArray;	//0x60 (0x20)
};

class ExternalFunction
{
public:
	BYTE ASM[0x20]				//0x0
	{
		0x48, 0x8B, 0xC1,		//mov rax, rcx
		0x48, 0x8B, 0x48, 0x08,	//mov rcx, [rax + 0x08]
		0x48, 0x8B, 0x50, 0x10,	//mov rdx, [rax + 0x10]
		0x4C, 0x8B, 0x40, 0x18,	//mov r8, [rax + 0x18]
		0x4C, 0x8B, 0x48, 0x20,	//mov r9, [rax + 0x20]
		0x48, 0x8B, 0x00,		//mov rax, [rax]
		0xFF, 0xE0,				//jmp rax
		0xCC, 0xCC, 0xCC, 0xCC,	//Padding
		0xCC, 0xCC, 0xCC, 0xCC,	//Padding
	};
	DWORD64 Address;			//0x20 (0x0)
	DWORD64 RCX;				//0x28 (0x8)
	DWORD64 RDX;				//0x30 (0x10)
	DWORD64 R8;					//0x38 (0x18)
	DWORD64 R9;					//0x40 (0x20)
};

class ActorValueHook
{
public:
	BYTE ActorValueASM[0x118]
	{
		0x8B, 0x42, 0x20,								//mov eax, [rdx+20]
		0x0F, 0x1F, 0x84, 0x00, 0x00, 0x00, 0x00, 0x00,	//nop (multi)
		0x0F, 0x1F, 0x84, 0x00, 0x00, 0x00, 0x00, 0x00,	//nop (multi)
		0x0F, 0x1F, 0x84, 0x00, 0x00, 0x00, 0x00, 0x00,	//nop (multi)
		0x0F, 0x1F, 0x00,								//nop (multi)
		0x3D, 0xD5, 0x02, 0x00, 0x00,					//cmp eax, 000002D5
		0x75, 0x14,										//jne StrengthCheck
		0x31, 0xC0,										//xor eax, eax
		0x3B, 0x05, 0xEB, 0x00, 0x00, 0x00,				//cmp eax, [ActionPointsEnabled]
		0x74, 0x0A,										//je StrengthCheck
		0xF3, 0x0F, 0x10, 0x15, 0xE5, 0x00, 0x00, 0x00,	//movss xmm2, [ActionPoints]
		0xEB, 0x19,										//jmp OriginalFunction
		0x3D, 0xC2, 0x02, 0x00, 0x00,					//cmp eax, 000002C2
		0x75, 0x14,										//jne PerceptionCheck
		0x31, 0xC0,										//xor eax, eax
		0x3B, 0x05, 0xD8, 0x00, 0x00, 0x00,				//cmp eax, [StrengthEnabled]
